Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: This guide covers the usage of MongoDB using active records and repositories.
zh_cn: 本指南涵盖了MongoDB使用活动记录和存储库的用法。

source: This guide covers:
zh_cn: 本指南包括：

source: This guide covers: * Gradle configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
zh_cn: 本指南涵盖了以下内容： * Gradle配置 * 创建新项目 * 处理扩展 * 开发模式 * 调试 * 在你的IDE中导入 * 构建原生可执行文件 * 构建容器友好型可执行文件

source: This guide covers: * Maven configuration * Creating a new project * Dealing with extensions * Development mode * Debugging * Import in your IDE * Building a native executable * Build a container friendly executable
zh_cn: 本指南涵盖了以下内容： * Maven配置 * 创建新项目 * 处理扩展 * 开发模式 * 调试 * 在IDE中导入 * 构建原生可执行文件 * 构建容器友好型可执行文件

source: This guide covers: * Testing in JVM mode * Testing in native mode * Injection of resources into tests
zh_cn: 本指南包括： * 在JVM模式下的测试 * 在原生模式下的测试 * 将资源注入测试

source: This guide demonstrates how to use Quarkus OpenID Connect (OIDC) Extension to protect your JAX-RS applications using Bearer Token Authorization where Bearer Tokens are issued by OpenID Connect and OAuth 2.0 compliant Authorization Servers such as https://www.keycloak.org[Keycloak].
zh_cn: 本指南演示了如何使用Quarkus OpenID Connect (OIDC)扩展来保护你的JAX-RS应用程序，使用不记名令牌授权(Bearer Tokens)，其中不记名令牌是由OpenID Connect和OAuth 2.0兼容的授权服务器（如 link:https://www.keycloak.org[Keycloak] ）颁发的。

source: This guide demonstrates how to use reactive routes.
zh_cn: 本指南演示了如何使用响应式路由。

source: This guide demonstrates how to use the Fabric8 Kubernetes client to interact with your Kubernetes cluster.
zh_cn: 本指南演示了如何使用Fabric8 Kubernetes客户端与你的Kubernetes集群互动。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS service application using Bearer Token Authorization where the tokens are issued by OpenID Connect Providers such as Keycloak.
zh_cn: 本指南演示了如何使用OpenID Connect扩展来保护你的Quarkus JAX-RS服务应用程序，使用Bearer令牌授权，其中令牌由OpenID Connect提供者（如Keycloak）出具。

source: This guide demonstrates how to use the OpenID Connect extension to protect your Quarkus JAX-RS web application using the Authorization Code Flow and OpenID Connect Providers such as Keycloak.
zh_cn: 本指南演示了如何使用OpenID Connect扩展来保护你的Quarkus JAX-RS网络应用程序，使用授权代码流和OpenID Connect提供者，如Keycloak。

source: This guide demonstrates how your OpenID Connect application can support multi-tenancy so that you can serve multiple tenants from a single application.
zh_cn: 本指南演示了你的OpenID Connect应用程序如何支持多租户，这样你就可以从一个应用程序中为多个租户提供服务。

source: This guide demonstrates how your Quarkus application can authorize a bearer token access to protected resources using https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak Authorization Services].
zh_cn: 本指南展示了如何在您的Quarkus应用程序中使用 link:https://www.keycloak.org/docs/latest/authorization_services/index.html[Keycloak授权服务] 来授权不记名token(bearer token)访问受保护的资源。

source: This guide demonstrates how your Quarkus application can authorize access to protected resources using Keycloak Authorization Services.
zh_cn: 本指南展示了你的Quarkus应用程序如何使用Keycloak授权服务来授权访问受保护的资源。

source: This guide demonstrates how your Quarkus application can collect metrics using the Micrometer extension.
zh_cn: 本指南展示了你的Quarkus应用程序如何使用Micrometer扩展来收集指标。

source: This guide demonstrates how your Quarkus application can connect to a Redis server using the Redis Client extension.
zh_cn: 本指南演示了如何将你的Quarkus应用通过Redis客户端扩展连接到Redis服务器。

source: This guide demonstrates how your Quarkus application can use JMS messaging with AMQP 1.0 using Apache Qpid JMS, or using Apache ActiveMQ Artemis JMS.
zh_cn: 本指南演示了你的Quarkus应用程序如何使用AMQP 1.0的Apache Qpid JMS，或使用Apache ActiveMQ Artemis JMS进行JMS信息传递。

source: This guide demonstrates how your Quarkus application can use Kogito to add business automation to power it up with business processes and rules.
zh_cn: 本指南演示了你的Quarkus应用程序如何使用Kogito来添加业务自动化，从而为其提供业务流程和规则。

source: This guide demonstrates how your Quarkus application can use WebAuthn authentication instead of passwords.
zh_cn: 本指南演示了你的Quarkus应用程序如何使用WebAuthn认证来代替密码。

source: This guide demonstrates how your Quarkus application can use a .properties file to store your user identities.
zh_cn: 本指南展示了你的Quarkus应用程序如何使用.properties文件来存储你的用户身份。

source: This guide demonstrates how your Quarkus application can use a LDAP directory to store your user identities.
zh_cn: 本指南展示了你的Quarkus应用程序如何使用LDAP目录来存储你的用户身份。

source: This guide demonstrates how your Quarkus application can use a database to store your user identities.
zh_cn: 本指南展示了你的Quarkus应用程序如何使用数据库来存储你的用户身份。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce HTTP messages.
zh_cn: 本指南演示您的 Quarkus 应用程序如何利用 SmallRye Reactive Messaging 来使用和生成 HTTP 消息。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to consume and produce messages via WebSockets.
zh_cn: 本指南演示了您的Quarkus应用程序如何利用SmallRye响应式消息通过WebSockets来消费和产生消息。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP 1.0.
zh_cn: 本指南演示了你的Quarkus应用程序如何使用SmallRye Reactive Messaging来与AMQP 1.0进行交互。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with AMQP.
zh_cn: 本指南展示了你的Quarkus应用程序如何利用SmallRye响应式消息传递与AMQP进行交互。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with Apache Kafka.
zh_cn: 本指南演示了您的Quarkus应用程序如何利用SmallRye响应式消息传递与Apache Kafka进行交互。

source: This guide demonstrates how your Quarkus application can utilize SmallRye Reactive Messaging to interact with RabbitMQ.
zh_cn: 本指南演示了您的 Quarkus 应用程序如何利用 SmallRye响应式消息传递与RabbitMQ进行交互。

source: This guide demonstrates how your Quarkus application can utilize the Apache Kafka Streams API to implement stream processing applications based on Apache Kafka.
zh_cn: 本指南展示了你的Quarkus应用如何利用Apache Kafka Streams API来实现基于Apache Kafka的流处理应用。

source: This guide demonstrates how your Quarkus application can utilize the Micrometer metrics library for runtime and application metrics.
zh_cn: 本指南展示了您的Quarkus应用程序如何利用Micrometer metrics库测量运行时和应用程序metrics。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance extension.
zh_cn: 本指南展示了你的Quarkus应用程序如何利用SmallRye容错扩展。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Fault Tolerance specification through the SmallRye Fault Tolerance extension.
zh_cn: 本指南展示了你的Quarkus应用程序如何通过SmallRye容错扩展来利用SmallRye容错规范。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Health extension.
zh_cn: 本指南展示了您的Quarkus应用程序如何利用SmallRye Health扩展。

source: This guide demonstrates how your Quarkus application can utilize the SmallRye Metrics extension.
zh_cn: 本指南展示了你的Quarkus应用程序如何利用SmallRye Metrics扩展。

source: This guide describes the asciidoc format and conventions that Quarkus has adopted.
zh_cn: 本指南描述了Quarkus采用的asciidoc格式和约定。

source: This guide explains Funqy's Amazon Lambda HTTP binding.
zh_cn: 本指南解释了Funqy的Amazon Lambda HTTP绑定。

source: This guide explains Funqy's Amazon Lambda binding.
zh_cn: 本指南解释了Funqy的Amazon Lambda绑定。

source: This guide explains Funqy's Azure Functions HTTP binding.
zh_cn: 本指南解释了Funqy的Azure Functions HTTP绑定。

source: This guide explains Funqy's Google Cloud Platform Functions HTTP binding.
zh_cn: 本指南解释了Funqy的Google Cloud Platform Functions HTTP绑定。

source: This guide explains Funqy's Google Cloud Platform Functions binding.
zh_cn: 本指南解释了Funqy的Google Cloud Platform Functions绑定。

source: This guide explains Funqy's HTTP binding.
zh_cn: 本指南解释了Funqy的HTTP绑定。

source: This guide explains Funqy's Knative Events binding.
zh_cn: 本指南解释了Funqy的Knative Events绑定。

source: This guide explains basics of the Funqy framework, a simple portable cross-provider cloud function API.
zh_cn: 本指南解释了Funqy框架的基础知识，这是一个简单的可移植的跨供应商的云功能API。

source: This guide explains how a Quarkus application can leverage the well known Spring Scheduled annotation to configure and schedule tasks.
zh_cn: 该指南解释了Quarkus应用程序如何利用众所周知的Spring Scheduled注解来配置和安排任务。

source: This guide explains how different beans can interact using the event bus.
zh_cn: 本指南解释了不同的Bean如何使用事件总线进行交互。

source: This guide explains how to best measure the footprint of a Quarkus application.
zh_cn: 本指南解释了如何最好地测量Quarkus应用程序的占用空间。

source: This guide explains how to cache expensive method calls of your CDI beans using simple annotations.
zh_cn: 本指南解释了如何使用简单的注解来缓存CDI Bean中昂贵的方法调用。

source: This guide explains how to centralize your logs with Logstash or Fluentd using the Graylog Extended Log Format (GELF).
zh_cn: 本指南解释了如何使用Graylog扩展日志格式（GELF）用Logstash或Fluentd集中管理你的日志。

source: This guide explains how to configure Quarkus to authenticate against well-known OpenID Connect providers such as GitHub, Google, Microsoft, Apple...
zh_cn: 本指南解释了如何配置Quarkus来验证著名的OpenID Connect提供者，如GitHub、谷歌、微软、苹果...

source: This guide explains how to consume gRPC services in your Quarkus application.
zh_cn: 本指南解释了如何在你的Quarkus应用程序中消费gRPC服务。

source: This guide explains how to deploy a Quarkus application to Google Cloud.
zh_cn: 本指南解释了如何将Quarkus应用程序部署到谷歌云。

source: This guide explains how to deploy a Quarkus application to Microsoft Azure Cloud.
zh_cn: 本指南解释了如何将Quarkus应用程序部署到Microsoft Azure云中。

source: This guide explains how to implement gRPC services in your Quarkus application.
zh_cn: 本指南解释了如何在你的Quarkus应用程序中实现gRPC服务。

source: This guide explains how to leverage SmallRye GraphQL Client to consume GraphQL services.
zh_cn: 本指南解释了如何利用SmallRye GraphQL客户端来消费GraphQL服务。

source: This guide explains how to leverage SmallRye GraphQL to implement GraphQL services.
zh_cn: 本指南解释了如何利用SmallRye GraphQL来实现GraphQL服务。

source: This guide explains how to measure the test coverage of your Quarkus application.
zh_cn: 本指南解释了如何测量你的Quarkus应用程序的测试覆盖率。

source: This guide explains how to migrate an application from RESTEasy Classic to RESTEasy Reactive.
zh_cn: 本指南介绍了如何将一个应用从RESTEasy 指令式迁移到RESTEasy 响应式。

source: This guide explains how to start using gRPC in your Quarkus application.
zh_cn: 本指南解释了如何在你的Quarkus应用程序中开始使用gRPC。

source: This guide explains how to use Blaze-Persistence to simplify your data and DTO layers.
zh_cn: 本指南解释了如何使用Blaze-Persistence来简化你的数据和DTO层。

source: This guide explains how to use Kotlin.
zh_cn: 本指南解释了如何使用Kotlin。

source: This guide explains how to use OpenID Connect and OAuth2 Client and Filters to acquire, refresh and propagate access tokens.
zh_cn: 本指南解释了如何使用OpenID Connect和OAuth2客户端和过滤器来获取、刷新和传播访问令牌。

source: This guide explains how to use Sentry to monitor your application and be notified when exceptions occur.
zh_cn: 本指南解释了如何使用Sentry来监控你的应用程序，并在发生异常时得到通知。

source: This guide explains how to use Vert.x in Quarkus to build reactive applications.
zh_cn: 本指南解释了如何在Quarkus中使用Vert.x来构建响应式应用程序。

source: This guide explains how to use the OpenAPI extension to generate an OpenAPI descriptor and get a Swagger UI frontend to test your REST endpoints.
zh_cn: 本指南解释了如何使用OpenAPI扩展来生成OpenAPI描述符，并获得一个Swagger UI前端来测试你的REST端点。

source: This guide explains how to use the RESTEasy REST Client in order to interact with REST APIs (JSON and other) with very little effort.
zh_cn: 本指南解释了如何使用RESTEasy REST客户端，以便用很少的精力与REST API（JSON和其他）进行交互。

source: This guide explains how to use the RESTEasy REST Client to send multipart REST requests, typically to upload documents.
zh_cn: 本指南介绍如何使用RESTEasy REST客户端发送多部分REST请求，通常是为了上传文档。

source: This guide explains how to use the RESTEasy Reactive REST Client.
zh_cn: 本指南解释了如何使用RESTEasy Reactive REST客户端。

source: This guide explains how you can access Git repositories with JGit.
zh_cn: 本指南解释了如何用JGit访问Git仓库。

source: This guide explains how you can deploy Quarkus-based Amazon Lambdas.
zh_cn: 本指南解释了如何部署基于Quarkus的Amazon Lambdas。

source: This guide explains how you can deploy Quarkus-based Google Cloud Functions.
zh_cn: 本指南解释了如何部署基于Quarkus的Google Cloud Functions。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as a Google Cloud Function.
zh_cn: 本指南介绍了如何将Vert.x Web、Servlet或RESTEasy微服务部署为Google Cloud Function。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Amazon Lambda.
zh_cn: 本指南介绍了如何将Vert.x Web、Servlet或RESTEasy微服务部署为Amazon Lambda。

source: This guide explains how you can deploy Vert.x Web, Servlet, or RESTEasy microservices as an Azure Function.
zh_cn: 本指南介绍了如何将Vert.x Web、Servlet或RESTEasy微服务部署为Azure Function。

source: This guide explains how you can use HashiCorp Vault for "encryption as a service".
zh_cn: 本指南解释了如何使用HashiCorp Vault进行 "加密即服务"。

source: This guide explains how you can use HashiCorp Vault to securely store your credentials in Quarkus.
zh_cn: 本指南解释了如何使用HashiCorp Vault在Quarkus中安全地存储您的凭证。

source: This guide explains how your Quarkus application can read configuration properties at runtime from Consul.
zh_cn: 本指南解释了你的Quarkus应用程序如何在运行时从Consul读取配置属性。

source: This guide explains how your Quarkus application can read configuration properties at runtime from the https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server].
zh_cn: 该指南阐述了你的Quarkus应用程序如何在运行时从 link:https://cloud.spring.io/spring-cloud-config[Spring Cloud Config Server] 中读取配置属性。

source: This guide explains how your Quarkus application can utilize OAuth2 tokens to provide secured access to the JAX-RS endpoints.
zh_cn: 本指南解释了你的Quarkus应用程序如何利用OAuth2令牌来提供对JAX-RS端点的安全访问。

source: This guide explains how your Quarkus application can utilize OpenTelemetry to provide distributed tracing for interactive web applications.
zh_cn: 本指南解释了你的Quarkus应用程序如何利用OpenTelemetry来为交互式Web应用程序提供分布式跟踪。

source: This guide explains how your Quarkus application can utilize OpenTracing to provide distributed tracing for interactive web applications.
zh_cn: 本指南解释了你的Quarkus应用程序如何利用OpenTracing来为交互式网络应用程序提供分布式跟踪。

source: This guide explains how your Quarkus application can utilize https://github.com/smallrye/smallrye-jwt/[SmallRye JWT] to verify https://tools.ietf.org/html/rfc7519[JSON Web Token]s, represent them as MicroProfile JWT `org.eclipse.microprofile.jwt.JsonWebToken` and provide secured access to the Quarkus HTTP endpoints using Bearer Token Authorization and https://en.wikipedia.org/wiki/Role-based_access_control[Role-Based Access Control].
zh_cn: 本指南旨在阐述如何在你的Quarkus应用程序中使用 https://github.com/smallrye/smallrye-jwt/[SmallRye JWT]来验证 https://tools.ietf.org/html/rfc7519[JSON Web Token]，并将它们呈现为MicroProfile JWT 的 `org.eclipse.microprofile.jwt.JsonWebToken` ，然后使用不记名令牌验证(Bearer Token Authorization)和 https://en.wikipedia.org/wiki/Role-based_access_control[基于角色的访问控制]来保证对Quarkus HTTP端点的安全访问。

source: This guide explains how your Quarkus application can utilize https://opentelemetry.io/[OpenTelemetry] to provide distributed tracing for interactive web applications.
zh_cn: 本指南解释了您的Quarkus应用程序如何利用 link:https://opentelemetry.io/[OpenTelemetry] 来为交互式Web应用提供分布式跟踪服务。

source: This guide explains how your Quarkus application can utilize web sockets to create interactive web applications. Because it’s the canonical web socket application, we are going to create a simple chat application.
zh_cn: 本指南解释了你的Quarkus应用程序如何利用网络套接字来创建交互式网络应用。因为它是典型的网络套接字应用程序，我们将创建一个简单的聊天应用程序。

source: This guide explains how your application can build, sign and/or encrypt JWT tokens with a fluent and configurable SmallRye JWT Build API.
zh_cn: 本指南解释了您的应用程序如何利用流畅且可配置的SmallRye JWT构建API构建、签署和/或加密JWT令牌。

source: This guide explains how your application can utilize SmallRye JWT to verify JWT tokens and provide secured access to the JAX-RS endpoints.
zh_cn: 本指南解释了您的应用程序如何利用SmallRye JWT来验证JWT令牌并为JAX-RS端点提供安全访问。

source: This guide explains logging and how to configure it.
zh_cn: 本指南解释了日志记录以及如何配置它。

source: This guide explains the various methods supported by Quarkus to authenticate to your Vault.
zh_cn: 本指南解释了Quarkus支持的各种方法来验证您的Vault。

source: This guide has shown how you can interact with AMQP 1.0 using Quarkus. It utilizes https://smallrye.io/smallrye-reactive-messaging[SmallRye Reactive Messaging] to build data streaming applications.
zh_cn: 本指南展示了如何使用Quarkus与AMQP 1.0进行交互。它使用 link:https://smallrye.io/smallrye-reactive-messaging[SmallRye响应式消息]来构建数据流应用程序。

source: This guide has shown how you can interact with Kafka using Quarkus. It utilizes SmallRye Reactive Messaging to build data streaming applications.
zh_cn: 本指南已经展示了如何使用Quarkus与Kafka进行交互。它利用SmallRye Reactive Messaging来构建数据流应用。

source: This guide introduced how you can use Vert.x APIs from a Quarkus application. It's just a brief overview. If you want to know more, check the xref:vertx-reference.adoc[reference guide about Vert.x in Quarkus].
zh_cn: 本指南介绍了如何在 Quarkus 应用程序中使用 Vert.x API。这只是一个简短的概述。如果你想了解更多信息，请查看 xref:vertx-reference.adoc[Quarkus 中有关 Vert.x 的参考指南]。

source: This guide is a brief introduction to some reactive features offered by Quarkus. Quarkus is a reactive framework, and so offers a lot of reactive features.
zh_cn: 本指南简要介绍了Quarkus提供的一些响应式特性。Quarkus是一个响应式框架，因此提供了许多响应式特性。

source: This guide is a collection of tips to help you solve the problems you encounter when compiling applications to native executable.
zh_cn: 本指南收集了一些提示，帮助你解决将应用程序编译为原生可执行文件时遇到的问题。

source: This guide is not an in-depth article about what _Reactive_ is and how Quarkus enables reactive architectures. If you want to read more about these topics, refer to the xref:quarkus-reactive-architecture.adoc[Reactive Architecture guide], which provides an overview of the Quarkus reactive ecosystem.
zh_cn: 本指南不是一篇关于 _Reactive_ 是什么以及Quarkus如何实现响应式架构的深入文章。 如果你想阅读更多关于这些主题的信息，请参考 xref:quarkus-reactive-architecture.adoc[响应式架构指南]，它提供了Quarkus响应式生态系统的概述。

source: This guide is the companion from the xref:amqp.adoc[Getting Started with AMQP 1.0]. It explains in more details the configuration and usage of the AMQP connector for reactive messaging.
zh_cn: 本指南是 xref:amqp.adoc[AMQP 1.0入门]的配套指南。它更详细地解释了响应式消息AMQP连接器的配置和使用。

source: This guide is the companion to the xref:vertx.adoc[Using Eclipse Vert.x API from a Quarkus Application] guide. It provides more advanced details about the usage and the configuration of the Vert.x instance used by Quarkus.
zh_cn: 本指南是《 link:vertx.html[从Quarkus应用程序中使用Eclipse Vert.x API] 》指南的补充。它提供了关于Quarkus使用的Vert.x实例的使用和配置的更多高级细节。

source: This guide is the entry point for everything security in Quarkus.
zh_cn: 本指南是Quarkus中一切安全问题的入口。

source: This guide presents how you can build a Quarkus application using:
zh_cn: 该指南介绍如何使用以下方法构建 Quarkus 应用程序:

source: This guide provides an in-depth look on Apache Kafka and SmallRye Reactive Messaging framework. For a quick start take a look at xref:kafka-reactive-getting-started.adoc[Getting Started to SmallRye Reactive Messaging with Apache Kafka].
zh_cn: 本指南深入介绍了Apache Kafka和SmallRye Reactive Messaging框架。要想快速入门，请参考 xref:kafka-reactive-getting-started.adoc[Getting Started to SmallRye Reactive Messaging with Apache Kafka] 。

source: This guide takes as input the application developed in the xref:getting-started.adoc[Getting Started Guide].
zh_cn: 本指南将 xref:getting-started.adoc[入门指南] 中开发的应用程序作为输入。

source: This guide uses the Mutiny API. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive, reactive programming library].
zh_cn: 该指南使用Mutiny API。如果你不熟悉Mutiny，请查看 link:mutiny-primer.html[Mutiny - 一个直观的、响应式的编程库] 。

source: This guide walks you through generating an example Java project via a Maven archetype. Later on, it walks through the structure of the project so you can adapt any existing projects you have to use Amazon Lambda.
zh_cn: 本指南将引导您通过Maven原型生成一个Java项目示例。随后，还将介绍项目的结构，以便您能够调整现有的项目以使用Amazon Lambda。

source: This guide walks you through generating an example Java project via a maven archetype and deploying it to AWS.
zh_cn: 本指南将指导你通过一个maven原型生成一个Java项目的例子，并将其部署到AWS。

source: This guide walks you through the process of creating a Quarkus application with OptaPlanner's constraint solving Artificial Intelligence (AI).
zh_cn: 本指南将引导你完成用OptaPlanner的约束解决人工智能（AI）创建Quarkus应用程序的过程。

source: This guide will help you with:
zh_cn: 本指南将帮助您：

source: This guides covers the usage of LRA to coordinate activities across services.
zh_cn: 本指南涵盖了使用LRA来协调跨服务的活动。

source: This guides covers the usage of Software Transactional Memory (STM).
zh_cn: 本指南涵盖了软件事务性内存（STM）的使用。

source: This guides explains how to use the Vault credentials provider or implement your own custom one.
zh_cn: 本指南解释了如何使用Vault凭证提供者或实现你自己的自定义凭证。

source: This handler is a bridge between the lambda runtime and the Quarkus HTTP framework you are using (JAX-RS, Servlet, etc.)
zh_cn: 这个处理程序是lambda运行时和你正在使用的Quarkus HTTP框架（JAX-RS、Servlet等）之间的桥梁。

source: This implies that you no longer need to install a JVM on your production environment, as the runtime technology is included in the produced binary, and optimized to run with minimal resource overhead.
zh_cn: 这意味着您不再需要在您的生产环境中安装JVM，因为运行时技术包含在生产的二进制文件中，并以最小的资源开销优化运行。

source: This index is created by default on the project on which Quarkus is configured for, thanks to our Maven and Gradle plugins.
zh_cn: 通过使用Maven和Gradle插件，这个索引在Quarkus的项目上的默认配置是自动创建。

source: This instance is retrieved and used to configure the client used by the connector. You need to indicate the name of the client using the `client-options-name` attribute:
zh_cn: 这个实例被检索，并用于配置连接器使用的客户端。你需要使用 `client-options-name` 属性指定客户端的名称。

source: This instructs the failsafe-maven-plugin to run integration-test and indicates the location of the produced native executable.
zh_cn: 这指示 failsafe-maven-plugin 运行集成测试，并指出生成的原生可执行文件的位置。

source: This instructs the failsafe-maven-plugin to run integration-test.
zh_cn: 这将通知failsafe-maven-plugin去运行继承测试。

source: This is a collection of preferred term in the documentation and website. Please stay within these terms for consistency.
zh_cn: 这是文件和网站中首选术语的集合。为了保持一致性，请保持在这些术语范围内。

source: This is a good example of how to integrate a Kafka consumer with another downstream, in this example exposing it as a Server-Sent Events endpoint.
zh_cn: 这个例子很好的展示了如何将Kafka consumer与另一个downstream进行集成。在这个例子中，我们将这个downstream暴露为一个服务端事件节点(Server-Sent Events endpoint)。

source: This is a permission set that references the previously defined policy. `roles1` is an arbitrary name, you can call the permission sets whatever you want.
zh_cn: 这是一个引用之前定义的策略的权限集。 `roles1` 是一个任意的名字，您可以随意的命名该权限集。

source: This is a very common case as JSON libraries typically use reflection to serialize the objects to JSON:
zh_cn: 这是一个非常常见的情况，因为JSON库通常使用反射来将对象序列化为JSON：

source: This is a very simple example using RBAC policies to govern access to your resources. However, Keycloak supports other types of policies that you can use to perform even more fine-grained access control. By using this example, you'll see that your application is completely decoupled from your authorization policies with enforcement being purely based on the accessed resource.
zh_cn: 该示例非常简单，它使用RBAC策略来管理对您的资源的访问。但是，Keycloak也支持其他类型的策略，您可以用这些策略来执行更细粒度的访问控制。通过这个例子，您会发现您的应用程序与授权策略完全解耦，授权策略的执行完全基于所访问的资源。

source: This is an introduction to writing JSON REST services with Quarkus. A more detailed guide about RESTEasy Reactive is available xref:resteasy-reactive.adoc[here].
zh_cn: 这是一个关于用Quarkus编写JSON REST服务的介绍。 link:resteasy-reactive.html[这里] 有关于RESTEasy Reactive的更详细的指南。

source: This is considered an advanced option and should only be performed if you fully understand the consequences of changing the scope of the bean.
zh_cn: 这是一个高级选项，只有在您完全了解改变Bean scope的后果时才可以执行。

source: This is covered in the xref:building-native-image.adoc[Native Executable Guide].
zh_cn: 这在《 link:building-native-image.html[本地可执行文件指南》] 中有所涉及。
